mtiutiu/Coding_Playground/sensors_network/project/esp8266_mqtt/ws2812fx_node/src/main.cpp
  return data;
}

void saveConfig(const char *cfgFilePath, CfgData &data) {
  if (SPIFFS.begin()) {
    if (SPIFFS.exists(cfgFilePath)) {
      File configFile = SPIFFS.open(cfgFilePath, "w");
      if (configFile) {
      // read config file
      #ifdef DEBUG
        DEBUG_OUTPUT.println("Config file found!");
      #endif

        StaticJsonBuffer<512> jsonBuffer;
        JsonObject &json = jsonBuffer.createObject();

        json["mqtt_server"] = data.mqtt_server;
        json["mqtt_user"] = data.mqtt_user;
        json["mqtt_passwd"] = data.mqtt_passwd;
        json["mqtt_port"] = data.mqtt_port;
        json["mqtt_in_topic_prefix"] = data.mqtt_in_topic_prefix;
        json["mqtt_out_topic_prefix"] = data.mqtt_out_topic_prefix;
        json["mys_node_id"] = data.mys_node_id;
        json["mys_node_alias"] = data.mys_node_alias;
        json["mys_node_led_count"] = data.mys_node_led_count;

        json.printTo(configFile);
        configFile.close();
      } else {
      // config file couldn't be opened
      #ifdef DEBUG
        DEBUG_OUTPUT.println("Config file couldn't be opened!");
      #endif
      }
    } else {
    // config file not found start portal
    #ifdef DEBUG
      DEBUG_OUTPUT.println("Config file wasn't found!");
    #endif
    }
    SPIFFS.end();
  } else {
  // fail to mount spiffs
  #ifdef DEBUG
    DEBUG_OUTPUT.println("SPIFFS mount failed!");
  #endif
  }
}

void onWiFiConfigPostHook(CfgData& cfgData) {
  // update led strip data after wifi config finished
  // led strip reinit and start
  ledStripInit(cfgData, true);
}

void startWiFiConfig(CfgData &cfgData, bool forciblyStart = false,
                      cb wifiPostConfigCallback = NULL) {
  // custom parameters
  WiFiManagerParameter mqtt_header_text("<br/><b>MQTT</b>");
  WiFiManagerParameter custom_mqtt_server(
    "server",
    "mqtt server",
    cfgData.mqtt_server,
    MQTT_SERVER_FIELD_MAX_LEN
  );
  WiFiManagerParameter custom_mqtt_server_user(
    "user",
    "mqtt user",
    cfgData.mqtt_user,
    MQTT_USER_FIELD_MAX_LEN
  );
  WiFiManagerParameter custom_mqtt_server_passwd(
    "passwd",
    "mqtt passwd",
    cfgData.mqtt_passwd,
    MQTT_PASS_FIELD_MAX_LEN
  );
  WiFiManagerParameter custom_mqtt_port(
    "port",
    "mqtt port",
    cfgData.mqtt_port,
    MQTT_PORT_FIELD_MAX_LEN,
    "min=\"1\" max=\"65535\""
  );
  WiFiManagerParameter custom_mqtt_in_topic_prefix(
    "in_topic_prefix",
    "mqtt in topic prefix",
    cfgData.mqtt_in_topic_prefix,
    MQTT_IN_TOPIC_PREFIX_FIELD_MAX_LEN
  );
  WiFiManagerParameter custom_mqtt_out_topic_prefix(
    "out_topic_prefix",
    "mqtt out topic prefix",
    cfgData.mqtt_out_topic_prefix,
    MQTT_OUT_TOPIC_PREFIX_FIELD_MAX_LEN
  );

  WiFiManagerParameter mys_header_text("<br/><br/><b>MySensors</b>");
  WiFiManagerParameter custom_mys_node_id(
    "node_id",
    "node id",
    cfgData.mys_node_id,
    MYS_NODE_ID_FIELD_MAX_LEN,
    "min=\"1\" max=\"254\""
  );
  WiFiManagerParameter custom_mys_node_alias(
    "node_alias",
    "node alias",
    cfgData.mys_node_alias,
    MYS_NODE_ALIAS_FIELD_MAX_LEN
  );
  WiFiManagerParameter custom_mys_node_led_count(
    "node_led_count",
    "led count",
    cfgData.mys_node_led_count,
    MYS_NODE_LED_COUNT_FIELD_MAX_LEN,
    "min=\"1\" max=\"" STRINGIFY(MAX_LED_COUNT) "\""
  );

  WiFiManager wifiManager;
  wifiManager.setSaveConfigCallback(saveConfigCallback);

  wifiManager.addParameter(&mqtt_header_text);
  wifiManager.addParameter(&custom_mqtt_server);
  wifiManager.addParameter(&custom_mqtt_server_user);
  wifiManager.addParameter(&custom_mqtt_server_passwd);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_in_topic_prefix);
  wifiManager.addParameter(&custom_mqtt_out_topic_prefix);

  wifiManager.addParameter(&mys_header_text);
  wifiManager.addParameter(&custom_mys_node_id);
  wifiManager.addParameter(&custom_mys_node_alias);
  wifiManager.addParameter(&custom_mys_node_led_count);

  if (forciblyStart) {
#ifdef DEBUG
    DEBUG_OUTPUT.println(
      "Resetting settings and forcing WiFi config portal to start ..."
    );
#endif
    wifiManager.resetSettings();
  }

#ifdef DEBUG
  DEBUG_OUTPUT.printf(
    "Starting WiFi autoconfig portal with %lus timeout...\r\n",
    CFG_PORTAL_TIMEOUT_S
  );
#endif
  wifiManager.setTimeout(CFG_PORTAL_TIMEOUT_S);
  if (!wifiManager.autoConnect(AP_SSID, AP_PASSWD)) {
#ifdef DEBUG
    DEBUG_OUTPUT.println(
      "Failed to connect and configuration portal timeout was reached, rebooting ..."
    );
#endif
    // fail to connect
    delay(1000);
    // reset and try again, or maybe put it to deep sleep
    ESP.restart();
  }

  if (configurationUpdated) {
#ifdef DEBUG
    DEBUG_OUTPUT.println("Configuration changed need to save it!");
#endif

    strncpy(
      cfgData.mqtt_server,
      custom_mqtt_server.getValue(),
      MQTT_SERVER_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mqtt_user,
      custom_mqtt_server_user.getValue(),
      MQTT_USER_FIELD_MAX_LEN);
    strncpy(
      cfgData.mqtt_passwd,
      custom_mqtt_server_passwd.getValue(),
      MQTT_PASS_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mqtt_port,
      custom_mqtt_port.getValue(),
      MQTT_PORT_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mqtt_in_topic_prefix,
      custom_mqtt_in_topic_prefix.getValue(),
      MQTT_IN_TOPIC_PREFIX_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mqtt_out_topic_prefix,
      custom_mqtt_out_topic_prefix.getValue(),
      MQTT_OUT_TOPIC_PREFIX_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mys_node_id,
      custom_mys_node_id.getValue(),
      MYS_NODE_ID_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mys_node_alias,
      custom_mys_node_alias.getValue(),
      MYS_NODE_ALIAS_FIELD_MAX_LEN
    );
    strncpy(
      cfgData.mys_node_led_count,
      custom_mys_node_led_count.getValue(),
      MYS_NODE_LED_COUNT_FIELD_MAX_LEN
    );

    // save new cfg data
    saveConfig(CONFIG_FILE, cfgData);

    if(wifiPostConfigCallback) {
      wifiPostConfigCallback(cfgData);
    }

